def ready_tuple(data):
    tuple_list = list()
    for eng in data['ArkPassiveEffects']:
        eng_tuple = (eng['Name'], eng['Level'],eng['AbilityStoneLevel'])
        tuple_list.append(eng_tuple)
    return tuple_list

def engraving(response):
    engrave_process = response['engravings']
    engrave_list = ready_tuple(engrave_process)
    a = engrave_list[0]
    b = engrave_list[1]
    c = engrave_list[2]
    d = engrave_list[3]
    e = engrave_list[4]
    # a,b,c,d,e는 튜플형태로 할 것.
    # 유물 : 0 / 유물 5 : 1 / 유물10 : 2 / 유물15 : 3 / 유물20 : 4
    # 돌이 무슨 돌인가? 6 7 9 10 -> 1 2 3 4  
    # ex) 원한 유각 10장 돌맹이9 = (원한,2,3)
    engraving_dict = {
        'Form' : {'피해 증가':[],
        '추가 피해':[],
        '기본 공격력 증가 (%)':[],
        '공격력 증가 (%)':[],
        '공격력 증가 (+)':[],
        '무기공격력 증가 (%)':[],
        '무기공격력 증가 (+)':[],
        '스탯 증가 (%)':[],
        '스탯 증가 (+)':[],
        '치명타 적중률 증가':[],
        '치명타 피해 증가':[],
        '치명타 시 피해 증가':[],
        '백어택':[],
        '헤드어택':[],
        '비방향성':[],
        '캐스팅':[],
        '차징':[],
        '쿨타임 감소':[],
        '진화형 피해':[],
        '물리 방어력':[],
        '마법 방어력':[],
        '체력':[],
        '최대 생명력':[],
        '생명력 활성':[]
        },
         
        '원한' : {
            '피해 증가':[1.18,1.1875,1.195,1.2025,1.21],
            '어빌리티 스톤':[0.03,0.0375,0.0525,0.06]
            },
        
        '아드레날린' : {
            '공격력 증가 (%)':[1.054,1.054,1.054,1.054,1.054],
            '치명타 적중률 증가':[14,15.5,17,18.5,20],
            '어빌리티 스톤':[0.0288,0.036,0.05,0.057]
            },
        '정밀 단도' : {
            '치명타 적중률 증가':[18,18.75,19.5,20.25,21],
            '치명타 피해 증가':[-6,-6,-6,-6,-6],
            '어빌리티 스톤':[3,3.75,5.25,6]
            },        
            
        '저주받은 인형' : {
            '피해 증가':[1.14,1.1475,1.155,1.1625,1.17],
            '어빌리티 스톤':[0.03,0.0375,0.0525,0.06]
            },

        '안정된 상태' : {
            '피해 증가':[1.14,1.1475,1.155,1.1625,1.17],
            '어빌리티 스톤':[0.03,0.0375,0.0525,0.06]
            },

        '돌격대장' : {
            '피해 증가':[1.16,1.168,1.176,1.184,1.192],
            '어빌리티 스톤':[0.03,0.0376,0.0528,0.06]
            },

        '질량 증가' : {
            '피해 증가':[1.16,1.1675,1.175,1.1825,1.19],
            '어빌리티 스톤':[0.03,0.0375,0.0525,0.06]
            },

        '예리한 둔기' : {
            '피해 증가':[0.98,0.98,0.98,0.98,0.98],
            '치명타 피해 증가':[44,46,48,50,52],
            '어빌리티 스톤':[7.5,9.4,13.2,15]
            },

        '결투의 대가' : {
            '피해 증가':[1.048,1.055,1.062,1.069,1.076],
            '헤드어택':[1.25/1.1,1.25/1.1,1.25/1.1,1.25/1.1,1.25/1.1],
            '어빌리티 스톤':[0.027,0.034,0.047,0.054]
            },

        '기습의 대가' : {
            '피해 증가':[1.048,1.055,1.062,1.069,1.076],
            '백어택':[1.20/1.05,1.20/1.05,1.20/1.05,1.20/1.05,1.20/1.05],
            '어빌리티 스톤':[0.027,0.034,0.047,0.054]
            },

        '타격의 대가' : {
            '비방향성':[1.14,1.1475,1.155,1.1625,1.17],
            '어빌리티 스톤':[0.03,0.0375,0.0525,0.06]
            },
        
        
        '바리케이드' : {
            '피해 증가':[1.14,1.1475,1.155,1.1625,1.17],
            '어빌리티 스톤':[0.03,0.0375,0.0525,0.06]
            },
        
        '달인의 저력' : {
            '피해 증가':[1.14,1.1475,1.155,1.1625,1.17],
            '어빌리티 스톤':[0.03,0.0375,0.0525,0.06]
            },
        
        '슈퍼 차지' : {
            '차징':[1.18,1.1875,1.195,1.2025,1.21],
            '어빌리티 스톤':[0.03,0.0375,0.0525,0.06]
            },
        
        '속전속결' : {
            '캐스팅':[1.18,1.1875,1.195,1.2025,1.21],
            '어빌리티 스톤':[0.03,0.0375,0.0525,0.06]
            },

        '마나 효율 증가' : {
            '피해 증가':[1.13,1.1375,1.145,1.1525,1.16],
            '어빌리티 스톤':[0.03,0.0375,0.0525,0.06]
            },
        '선수필승':{},
        '승부사':{},
        '정기흡수':{},
        '각성':{},
        '전문의':{},
        '최대 마나 증가':{},
        '구슬 동자':{},
        '중갑 착용':{},
        '마나의 흐름':{}        
        }
    # 원한 -> (원한,2,2) 형태로 넣을 것이라고 가정
    def engrave_def(x):
        if x[-1] == None:
            pass
        else:
            key_list = list(engraving_dict[x[0]].keys())
            stone_stat = engraving_dict[x[0]]['어빌리티 스톤'][x[2]-1]
            engraving_dict[x[0]][key_list[-2]] = [v+stone_stat for v in engraving_dict[x[0]][key_list[-2]]]
        for m,n in list(engraving_dict[x[0]].items())[:-1]:
            engraving_dict['Form'][m].append(n[x[1]])

    for x in [a,b,c,d,e]:
        engrave_def(x)

    return engraving_dict['Form'], engrave_list